Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 768, 1024, 3 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 768, 1024, 10 120         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 768, 1024, 10 40          conv2d[0][0]                     
__________________________________________________________________________________________________
dropout (Dropout)               (None, 768, 1024, 10 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 768, 1024, 10 400         dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 768, 1024, 10 40          conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 768, 1024, 10 400         batch_normalization_1[0][0]      
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 768, 1024, 10 40          conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 768, 1024, 10 130         input_1[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 768, 1024, 10 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 768, 1024, 10 40          conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 768, 1024, 10 400         dropout_1[0][0]                  
__________________________________________________________________________________________________
activation (Activation)         (None, 768, 1024, 10 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 768, 1024, 10 40          conv2d_3[0][0]                   
__________________________________________________________________________________________________
add (Add)                       (None, 768, 1024, 10 0           activation[0][0]                 
                                                                 batch_normalization_3[0][0]      
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 384, 512, 10) 0           add[0][0]                        
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 384, 512, 20) 800         max_pooling2d[0][0]              
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 384, 512, 20) 80          conv2d_5[0][0]                   
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 384, 512, 20) 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 384, 512, 20) 1600        dropout_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 384, 512, 20) 80          conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 384, 512, 20) 1600        batch_normalization_6[0][0]      
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 384, 512, 20) 80          conv2d_7[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 384, 512, 20) 820         max_pooling2d[0][0]              
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 384, 512, 20) 0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 384, 512, 20) 80          conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 384, 512, 20) 1600        dropout_3[0][0]                  
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 384, 512, 20) 0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 384, 512, 20) 80          conv2d_8[0][0]                   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 384, 512, 20) 0           activation_1[0][0]               
                                                                 batch_normalization_8[0][0]      
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 192, 256, 20) 0           add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 192, 256, 40) 3200        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 192, 256, 40) 160         conv2d_10[0][0]                  
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 192, 256, 40) 0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 192, 256, 40) 6400        dropout_4[0][0]                  
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 192, 256, 40) 160         conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 192, 256, 40) 6400        batch_normalization_11[0][0]     
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 192, 256, 40) 160         conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 192, 256, 40) 3240        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 192, 256, 40) 0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 192, 256, 40) 160         conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 192, 256, 40) 6400        dropout_5[0][0]                  
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 192, 256, 40) 0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 192, 256, 40) 160         conv2d_13[0][0]                  
__________________________________________________________________________________________________
add_2 (Add)                     (None, 192, 256, 40) 0           activation_2[0][0]               
                                                                 batch_normalization_13[0][0]     
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 96, 128, 40)  0           add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 96, 128, 80)  12800       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 96, 128, 80)  320         conv2d_15[0][0]                  
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 96, 128, 80)  0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 96, 128, 80)  25600       dropout_6[0][0]                  
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 96, 128, 80)  320         conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 96, 128, 80)  25600       batch_normalization_16[0][0]     
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 96, 128, 80)  320         conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 96, 128, 80)  12880       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 96, 128, 80)  0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 96, 128, 80)  320         conv2d_19[0][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 96, 128, 80)  25600       dropout_7[0][0]                  
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 96, 128, 80)  0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 96, 128, 80)  320         conv2d_18[0][0]                  
__________________________________________________________________________________________________
add_3 (Add)                     (None, 96, 128, 80)  0           activation_3[0][0]               
                                                                 batch_normalization_18[0][0]     
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 48, 64, 80)   0           add_3[0][0]                      
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 48, 64, 160)  51200       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 48, 64, 160)  640         conv2d_20[0][0]                  
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 48, 64, 160)  0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 48, 64, 160)  102400      dropout_8[0][0]                  
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 48, 64, 160)  640         conv2d_21[0][0]                  
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 96, 128, 160) 0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 96, 128, 240) 0           up_sampling2d[0][0]              
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 96, 128, 80)  76800       concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 96, 128, 80)  320         conv2d_22[0][0]                  
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 96, 128, 80)  25600       batch_normalization_22[0][0]     
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 96, 128, 80)  320         conv2d_23[0][0]                  
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 96, 128, 80)  25600       batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 96, 128, 80)  76880       concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 96, 128, 80)  320         conv2d_24[0][0]                  
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 96, 128, 80)  320         conv2d_26[0][0]                  
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 96, 128, 80)  25600       batch_normalization_24[0][0]     
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 96, 128, 80)  0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 96, 128, 80)  320         conv2d_25[0][0]                  
__________________________________________________________________________________________________
add_4 (Add)                     (None, 96, 128, 80)  0           activation_4[0][0]               
                                                                 batch_normalization_25[0][0]     
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 192, 256, 80) 0           add_4[0][0]                      
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 192, 256, 120 0           up_sampling2d_1[0][0]            
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 192, 256, 40) 19200       concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 192, 256, 40) 160         conv2d_27[0][0]                  
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 192, 256, 40) 6400        batch_normalization_27[0][0]     
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 192, 256, 40) 160         conv2d_28[0][0]                  
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 192, 256, 40) 6400        batch_normalization_28[0][0]     
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 192, 256, 40) 19240       concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 192, 256, 40) 160         conv2d_29[0][0]                  
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 192, 256, 40) 160         conv2d_31[0][0]                  
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 192, 256, 40) 6400        batch_normalization_29[0][0]     
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 192, 256, 40) 0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 192, 256, 40) 160         conv2d_30[0][0]                  
__________________________________________________________________________________________________
add_5 (Add)                     (None, 192, 256, 40) 0           activation_5[0][0]               
                                                                 batch_normalization_30[0][0]     
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 384, 512, 40) 0           add_5[0][0]                      
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 384, 512, 60) 0           up_sampling2d_2[0][0]            
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 384, 512, 20) 4800        concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 384, 512, 20) 80          conv2d_32[0][0]                  
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 384, 512, 20) 1600        batch_normalization_32[0][0]     
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 384, 512, 20) 80          conv2d_33[0][0]                  
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 384, 512, 20) 1600        batch_normalization_33[0][0]     
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 384, 512, 20) 4820        concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 384, 512, 20) 80          conv2d_34[0][0]                  
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 384, 512, 20) 80          conv2d_36[0][0]                  
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 384, 512, 20) 1600        batch_normalization_34[0][0]     
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 384, 512, 20) 0           batch_normalization_36[0][0]     
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 384, 512, 20) 80          conv2d_35[0][0]                  
__________________________________________________________________________________________________
add_6 (Add)                     (None, 384, 512, 20) 0           activation_6[0][0]               
                                                                 batch_normalization_35[0][0]     
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 768, 1024, 20 0           add_6[0][0]                      
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 768, 1024, 30 0           up_sampling2d_3[0][0]            
                                                                 add[0][0]                        
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 768, 1024, 10 1200        concatenate_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 768, 1024, 10 40          conv2d_37[0][0]                  
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 768, 1024, 10 400         batch_normalization_37[0][0]     
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 768, 1024, 10 40          conv2d_38[0][0]                  
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 768, 1024, 10 400         batch_normalization_38[0][0]     
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, 768, 1024, 10 1210        concatenate_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, 768, 1024, 10 40          conv2d_39[0][0]                  
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, 768, 1024, 10 40          conv2d_41[0][0]                  
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 768, 1024, 10 400         batch_normalization_39[0][0]     
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 768, 1024, 10 0           batch_normalization_41[0][0]     
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 768, 1024, 10 40          conv2d_40[0][0]                  
__________________________________________________________________________________________________
add_7 (Add)                     (None, 768, 1024, 10 0           activation_7[0][0]               
                                                                 batch_normalization_40[0][0]     
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, 768, 1024, 2) 22          add_7[0][0]                      
==================================================================================================
Total params: 603,042
Trainable params: 599,402
Non-trainable params: 3,640
__________________________________________________________________________________________________
