Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 4096, 4096,  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 4096, 4096, 1 156         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 4096, 4096, 1 52          conv2d[0][0]                     
__________________________________________________________________________________________________
dropout (Dropout)               (None, 4096, 4096, 1 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 4096, 4096, 1 676         dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 4096, 4096, 1 52          conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 2048, 2048, 1 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 2048, 2048, 2 1352        max_pooling2d[0][0]              
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 2048, 2048, 2 104         conv2d_2[0][0]                   
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 2048, 2048, 2 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 2048, 2048, 2 2704        dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 2048, 2048, 2 104         conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 1024, 1024, 2 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 1024, 1024, 5 5408        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 1024, 1024, 5 208         conv2d_4[0][0]                   
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 1024, 1024, 5 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 1024, 1024, 5 10816       dropout_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 1024, 1024, 5 208         conv2d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 512, 512, 52) 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 512, 512, 104 21632       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 512, 512, 104 416         conv2d_6[0][0]                   
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 512, 512, 104 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 512, 512, 104 43264       dropout_3[0][0]                  
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 512, 512, 104 416         conv2d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 256, 256, 104 0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 256, 256, 208 86528       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 256, 256, 208 832         conv2d_8[0][0]                   
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 256, 256, 208 0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 256, 256, 208 173056      dropout_4[0][0]                  
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 256, 256, 208 832         conv2d_9[0][0]                   
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 512, 512, 208 0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 512, 512, 312 0           up_sampling2d[0][0]              
                                                                 batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 512, 512, 104 129792      concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 512, 512, 104 416         conv2d_10[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 512, 512, 104 43264       batch_normalization_10[0][0]     
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 512, 512, 104 416         conv2d_11[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 1024, 1024, 1 0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1024, 1024, 1 0           up_sampling2d_1[0][0]            
                                                                 batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 1024, 1024, 5 32448       concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 1024, 1024, 5 208         conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 1024, 1024, 5 10816       batch_normalization_12[0][0]     
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 1024, 1024, 5 208         conv2d_13[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 2048, 2048, 5 0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 2048, 2048, 7 0           up_sampling2d_2[0][0]            
                                                                 batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 2048, 2048, 2 8112        concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 2048, 2048, 2 104         conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 2048, 2048, 2 2704        batch_normalization_14[0][0]     
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 2048, 2048, 2 104         conv2d_15[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 4096, 4096, 2 0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 4096, 4096, 3 0           up_sampling2d_3[0][0]            
                                                                 batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 4096, 4096, 1 2028        concatenate_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 4096, 4096, 1 52          conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 4096, 4096, 1 676         batch_normalization_16[0][0]     
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 4096, 4096, 1 52          conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 4096, 4096, 4 56          batch_normalization_17[0][0]     
==================================================================================================
Total params: 580,272
Trainable params: 577,880
Non-trainable params: 2,392
__________________________________________________________________________________________________
