Model: "functional_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 768, 1024, 3 0                                            
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 768, 1024, 13 156         input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 768, 1024, 13 52          conv2d_19[0][0]                  
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 768, 1024, 13 0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 768, 1024, 13 676         dropout_5[0][0]                  
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 768, 1024, 13 52          conv2d_20[0][0]                  
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 768, 1024, 13 676         batch_normalization_19[0][0]     
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 768, 1024, 13 52          conv2d_21[0][0]                  
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 768, 1024, 13 169         input_2[0][0]                    
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 768, 1024, 13 0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 768, 1024, 13 52          conv2d_23[0][0]                  
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 768, 1024, 13 676         dropout_6[0][0]                  
__________________________________________________________________________________________________
activation (Activation)         (None, 768, 1024, 13 0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 768, 1024, 13 52          conv2d_22[0][0]                  
__________________________________________________________________________________________________
add (Add)                       (None, 768, 1024, 13 0           activation[0][0]                 
                                                                 batch_normalization_21[0][0]     
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 384, 512, 13) 0           add[0][0]                        
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 384, 512, 26) 1352        max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 384, 512, 26) 104         conv2d_24[0][0]                  
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 384, 512, 26) 0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 384, 512, 26) 2704        dropout_7[0][0]                  
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 384, 512, 26) 104         conv2d_25[0][0]                  
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 384, 512, 26) 2704        batch_normalization_24[0][0]     
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 384, 512, 26) 104         conv2d_26[0][0]                  
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 384, 512, 26) 1378        max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 384, 512, 26) 0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 384, 512, 26) 104         conv2d_28[0][0]                  
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 384, 512, 26) 2704        dropout_8[0][0]                  
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 384, 512, 26) 0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 384, 512, 26) 104         conv2d_27[0][0]                  
__________________________________________________________________________________________________
add_1 (Add)                     (None, 384, 512, 26) 0           activation_1[0][0]               
                                                                 batch_normalization_26[0][0]     
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 192, 256, 26) 0           add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 192, 256, 52) 5408        max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 192, 256, 52) 208         conv2d_29[0][0]                  
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 192, 256, 52) 0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 192, 256, 52) 10816       dropout_9[0][0]                  
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 192, 256, 52) 208         conv2d_30[0][0]                  
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 192, 256, 52) 10816       batch_normalization_29[0][0]     
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 192, 256, 52) 208         conv2d_31[0][0]                  
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 192, 256, 52) 5460        max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 192, 256, 52) 0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 192, 256, 52) 208         conv2d_33[0][0]                  
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 192, 256, 52) 10816       dropout_10[0][0]                 
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 192, 256, 52) 0           batch_normalization_32[0][0]     
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 192, 256, 52) 208         conv2d_32[0][0]                  
__________________________________________________________________________________________________
add_2 (Add)                     (None, 192, 256, 52) 0           activation_2[0][0]               
                                                                 batch_normalization_31[0][0]     
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 96, 128, 52)  0           add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 96, 128, 104) 21632       max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 96, 128, 104) 416         conv2d_34[0][0]                  
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, 96, 128, 104) 0           batch_normalization_33[0][0]     
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 96, 128, 104) 43264       dropout_11[0][0]                 
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 96, 128, 104) 416         conv2d_35[0][0]                  
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 96, 128, 104) 43264       batch_normalization_34[0][0]     
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 96, 128, 104) 416         conv2d_36[0][0]                  
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 96, 128, 104) 21736       max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, 96, 128, 104) 0           batch_normalization_35[0][0]     
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 96, 128, 104) 416         conv2d_38[0][0]                  
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 96, 128, 104) 43264       dropout_12[0][0]                 
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 96, 128, 104) 0           batch_normalization_37[0][0]     
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 96, 128, 104) 416         conv2d_37[0][0]                  
__________________________________________________________________________________________________
add_3 (Add)                     (None, 96, 128, 104) 0           activation_3[0][0]               
                                                                 batch_normalization_36[0][0]     
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 48, 64, 104)  0           add_3[0][0]                      
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 48, 64, 208)  86528       max_pooling2d_7[0][0]            
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 48, 64, 208)  832         conv2d_39[0][0]                  
__________________________________________________________________________________________________
dropout_13 (Dropout)            (None, 48, 64, 208)  0           batch_normalization_38[0][0]     
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 48, 64, 208)  173056      dropout_13[0][0]                 
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, 48, 64, 208)  832         conv2d_40[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_4 (UpSampling2D)  (None, 96, 128, 208) 0           batch_normalization_39[0][0]     
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 96, 128, 312) 0           up_sampling2d_4[0][0]            
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, 96, 128, 104) 129792      concatenate_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 96, 128, 104) 416         conv2d_41[0][0]                  
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, 96, 128, 104) 43264       batch_normalization_40[0][0]     
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, 96, 128, 104) 416         conv2d_42[0][0]                  
__________________________________________________________________________________________________
conv2d_43 (Conv2D)              (None, 96, 128, 104) 43264       batch_normalization_41[0][0]     
__________________________________________________________________________________________________
conv2d_45 (Conv2D)              (None, 96, 128, 104) 129896      concatenate_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, 96, 128, 104) 416         conv2d_43[0][0]                  
__________________________________________________________________________________________________
batch_normalization_44 (BatchNo (None, 96, 128, 104) 416         conv2d_45[0][0]                  
__________________________________________________________________________________________________
conv2d_44 (Conv2D)              (None, 96, 128, 104) 43264       batch_normalization_42[0][0]     
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 96, 128, 104) 0           batch_normalization_44[0][0]     
__________________________________________________________________________________________________
batch_normalization_43 (BatchNo (None, 96, 128, 104) 416         conv2d_44[0][0]                  
__________________________________________________________________________________________________
add_4 (Add)                     (None, 96, 128, 104) 0           activation_4[0][0]               
                                                                 batch_normalization_43[0][0]     
__________________________________________________________________________________________________
up_sampling2d_5 (UpSampling2D)  (None, 192, 256, 104 0           add_4[0][0]                      
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 192, 256, 156 0           up_sampling2d_5[0][0]            
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_46 (Conv2D)              (None, 192, 256, 52) 32448       concatenate_5[0][0]              
__________________________________________________________________________________________________
batch_normalization_45 (BatchNo (None, 192, 256, 52) 208         conv2d_46[0][0]                  
__________________________________________________________________________________________________
conv2d_47 (Conv2D)              (None, 192, 256, 52) 10816       batch_normalization_45[0][0]     
__________________________________________________________________________________________________
batch_normalization_46 (BatchNo (None, 192, 256, 52) 208         conv2d_47[0][0]                  
__________________________________________________________________________________________________
conv2d_48 (Conv2D)              (None, 192, 256, 52) 10816       batch_normalization_46[0][0]     
__________________________________________________________________________________________________
conv2d_50 (Conv2D)              (None, 192, 256, 52) 32500       concatenate_5[0][0]              
__________________________________________________________________________________________________
batch_normalization_47 (BatchNo (None, 192, 256, 52) 208         conv2d_48[0][0]                  
__________________________________________________________________________________________________
batch_normalization_49 (BatchNo (None, 192, 256, 52) 208         conv2d_50[0][0]                  
__________________________________________________________________________________________________
conv2d_49 (Conv2D)              (None, 192, 256, 52) 10816       batch_normalization_47[0][0]     
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 192, 256, 52) 0           batch_normalization_49[0][0]     
__________________________________________________________________________________________________
batch_normalization_48 (BatchNo (None, 192, 256, 52) 208         conv2d_49[0][0]                  
__________________________________________________________________________________________________
add_5 (Add)                     (None, 192, 256, 52) 0           activation_5[0][0]               
                                                                 batch_normalization_48[0][0]     
__________________________________________________________________________________________________
up_sampling2d_6 (UpSampling2D)  (None, 384, 512, 52) 0           add_5[0][0]                      
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 384, 512, 78) 0           up_sampling2d_6[0][0]            
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_51 (Conv2D)              (None, 384, 512, 26) 8112        concatenate_6[0][0]              
__________________________________________________________________________________________________
batch_normalization_50 (BatchNo (None, 384, 512, 26) 104         conv2d_51[0][0]                  
__________________________________________________________________________________________________
conv2d_52 (Conv2D)              (None, 384, 512, 26) 2704        batch_normalization_50[0][0]     
__________________________________________________________________________________________________
batch_normalization_51 (BatchNo (None, 384, 512, 26) 104         conv2d_52[0][0]                  
__________________________________________________________________________________________________
conv2d_53 (Conv2D)              (None, 384, 512, 26) 2704        batch_normalization_51[0][0]     
__________________________________________________________________________________________________
conv2d_55 (Conv2D)              (None, 384, 512, 26) 8138        concatenate_6[0][0]              
__________________________________________________________________________________________________
batch_normalization_52 (BatchNo (None, 384, 512, 26) 104         conv2d_53[0][0]                  
__________________________________________________________________________________________________
batch_normalization_54 (BatchNo (None, 384, 512, 26) 104         conv2d_55[0][0]                  
__________________________________________________________________________________________________
conv2d_54 (Conv2D)              (None, 384, 512, 26) 2704        batch_normalization_52[0][0]     
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 384, 512, 26) 0           batch_normalization_54[0][0]     
__________________________________________________________________________________________________
batch_normalization_53 (BatchNo (None, 384, 512, 26) 104         conv2d_54[0][0]                  
__________________________________________________________________________________________________
add_6 (Add)                     (None, 384, 512, 26) 0           activation_6[0][0]               
                                                                 batch_normalization_53[0][0]     
__________________________________________________________________________________________________
up_sampling2d_7 (UpSampling2D)  (None, 768, 1024, 26 0           add_6[0][0]                      
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 768, 1024, 39 0           up_sampling2d_7[0][0]            
                                                                 add[0][0]                        
__________________________________________________________________________________________________
conv2d_56 (Conv2D)              (None, 768, 1024, 13 2028        concatenate_7[0][0]              
__________________________________________________________________________________________________
batch_normalization_55 (BatchNo (None, 768, 1024, 13 52          conv2d_56[0][0]                  
__________________________________________________________________________________________________
conv2d_57 (Conv2D)              (None, 768, 1024, 13 676         batch_normalization_55[0][0]     
__________________________________________________________________________________________________
batch_normalization_56 (BatchNo (None, 768, 1024, 13 52          conv2d_57[0][0]                  
__________________________________________________________________________________________________
conv2d_58 (Conv2D)              (None, 768, 1024, 13 676         batch_normalization_56[0][0]     
__________________________________________________________________________________________________
conv2d_60 (Conv2D)              (None, 768, 1024, 13 2041        concatenate_7[0][0]              
__________________________________________________________________________________________________
batch_normalization_57 (BatchNo (None, 768, 1024, 13 52          conv2d_58[0][0]                  
__________________________________________________________________________________________________
batch_normalization_59 (BatchNo (None, 768, 1024, 13 52          conv2d_60[0][0]                  
__________________________________________________________________________________________________
conv2d_59 (Conv2D)              (None, 768, 1024, 13 676         batch_normalization_57[0][0]     
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 768, 1024, 13 0           batch_normalization_59[0][0]     
__________________________________________________________________________________________________
batch_normalization_58 (BatchNo (None, 768, 1024, 13 52          conv2d_59[0][0]                  
__________________________________________________________________________________________________
add_7 (Add)                     (None, 768, 1024, 13 0           activation_7[0][0]               
                                                                 batch_normalization_58[0][0]     
__________________________________________________________________________________________________
conv2d_61 (Conv2D)              (None, 768, 1024, 2) 28          add_7[0][0]                      
==================================================================================================
Total params: 1,016,082
Trainable params: 1,011,350
Non-trainable params: 4,732
__________________________________________________________________________________________________
