Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 512, 512, 3) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 512, 512, 6)  78          input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 512, 512, 6)  24          conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 512, 512, 6)  24          input_1[0][0]                    
__________________________________________________________________________________________________
activation (Activation)         (None, 512, 512, 6)  0           batch_normalization[0][0]        
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 512, 512, 6)  24          conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 512, 512, 6)  150         activation[0][0]                 
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 512, 512, 6)  0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
add (Add)                       (None, 512, 512, 6)  0           conv2d_1[0][0]                   
                                                                 activation_1[0][0]               
__________________________________________________________________________________________________
dropout (Dropout)               (None, 512, 512, 6)  0           add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 512, 512, 6)  24          dropout[0][0]                    
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 512, 512, 6)  0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 256, 256, 12) 5844        activation_2[0][0]               
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 256, 256, 12) 0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 256, 256, 12) 84          add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 256, 256, 12) 48          dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 256, 256, 12) 48          conv2d_5[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 256, 256, 12) 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 256, 256, 12) 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 256, 256, 12) 11676       activation_3[0][0]               
__________________________________________________________________________________________________
add_1 (Add)                     (None, 256, 256, 12) 0           activation_4[0][0]               
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 256, 256, 12) 0           add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 256, 256, 12) 48          dropout_2[0][0]                  
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 256, 256, 12) 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 128, 128, 24) 23352       activation_5[0][0]               
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 128, 128, 24) 0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 128, 128, 24) 312         add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 128, 128, 24) 96          dropout_3[0][0]                  
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 128, 128, 24) 96          conv2d_8[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 128, 128, 24) 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 128, 128, 24) 0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 128, 128, 24) 46680       activation_6[0][0]               
__________________________________________________________________________________________________
add_2 (Add)                     (None, 128, 128, 24) 0           activation_7[0][0]               
                                                                 conv2d_7[0][0]                   
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 128, 128, 24) 0           add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 128, 128, 24) 96          dropout_4[0][0]                  
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 128, 128, 24) 0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 64, 64, 48)   93360       activation_8[0][0]               
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 64, 64, 48)   0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 64, 64, 48)   1200        add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 64, 64, 48)   192         dropout_5[0][0]                  
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 64, 64, 48)   192         conv2d_11[0][0]                  
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 64, 64, 48)   0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 64, 64, 48)   0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 64, 64, 48)   186672      activation_9[0][0]               
__________________________________________________________________________________________________
add_3 (Add)                     (None, 64, 64, 48)   0           activation_10[0][0]              
                                                                 conv2d_10[0][0]                  
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 64, 64, 48)   0           add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 64, 64, 48)   192         dropout_6[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 64, 64, 48)   0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 32, 32, 96)   373344      activation_11[0][0]              
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 32, 32, 96)   0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 32, 32, 96)   4704        add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 32, 32, 96)   384         dropout_7[0][0]                  
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 32, 32, 96)   384         conv2d_14[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 32, 32, 96)   0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 32, 32, 96)   0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 32, 32, 96)   746592      activation_12[0][0]              
__________________________________________________________________________________________________
add_4 (Add)                     (None, 32, 32, 96)   0           activation_13[0][0]              
                                                                 conv2d_13[0][0]                  
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 32, 32, 96)   0           add_4[0][0]                      
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 32, 32, 96)   384         dropout_8[0][0]                  
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 32, 32, 96)   0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 32, 32, 96)   746592      activation_14[0][0]              
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 32, 32, 96)   0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 32, 32, 96)   384         dropout_9[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 32, 32, 96)   0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 32, 32, 96)   746592      activation_15[0][0]              
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 64, 64, 96)   0           conv2d_16[0][0]                  
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 64, 64, 144)  0           up_sampling2d[0][0]              
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 64, 64, 144)  0           concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 64, 64, 144)  576         dropout_10[0][0]                 
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 64, 64, 144)  0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 64, 64, 96)   1119840     activation_16[0][0]              
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, 64, 64, 96)   0           conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 64, 64, 96)   13920       concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 64, 64, 96)   384         dropout_11[0][0]                 
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 64, 64, 96)   384         conv2d_19[0][0]                  
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 64, 64, 96)   0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 64, 64, 96)   0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 64, 64, 96)   746592      activation_17[0][0]              
__________________________________________________________________________________________________
add_5 (Add)                     (None, 64, 64, 96)   0           activation_18[0][0]              
                                                                 conv2d_18[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 128, 128, 96) 0           add_5[0][0]                      
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 128, 128, 120 0           up_sampling2d_1[0][0]            
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, 128, 128, 120 0           concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 128, 128, 120 480         dropout_12[0][0]                 
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 128, 128, 120 0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 128, 128, 48) 466608      activation_19[0][0]              
__________________________________________________________________________________________________
dropout_13 (Dropout)            (None, 128, 128, 48) 0           conv2d_20[0][0]                  
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 128, 128, 48) 5808        concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 128, 128, 48) 192         dropout_13[0][0]                 
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 128, 128, 48) 192         conv2d_22[0][0]                  
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 128, 128, 48) 0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 128, 128, 48) 0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 128, 128, 48) 186672      activation_20[0][0]              
__________________________________________________________________________________________________
add_6 (Add)                     (None, 128, 128, 48) 0           activation_21[0][0]              
                                                                 conv2d_21[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 256, 256, 48) 0           add_6[0][0]                      
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 256, 256, 60) 0           up_sampling2d_2[0][0]            
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
dropout_14 (Dropout)            (None, 256, 256, 60) 0           concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 256, 256, 60) 240         dropout_14[0][0]                 
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 256, 256, 60) 0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 256, 256, 24) 116664      activation_22[0][0]              
__________________________________________________________________________________________________
dropout_15 (Dropout)            (None, 256, 256, 24) 0           conv2d_23[0][0]                  
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 256, 256, 24) 1464        concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 256, 256, 24) 96          dropout_15[0][0]                 
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 256, 256, 24) 96          conv2d_25[0][0]                  
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 256, 256, 24) 0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 256, 256, 24) 0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 256, 256, 24) 46680       activation_23[0][0]              
__________________________________________________________________________________________________
add_7 (Add)                     (None, 256, 256, 24) 0           activation_24[0][0]              
                                                                 conv2d_24[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 512, 512, 24) 0           add_7[0][0]                      
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 512, 512, 30) 0           up_sampling2d_3[0][0]            
                                                                 add[0][0]                        
__________________________________________________________________________________________________
dropout_16 (Dropout)            (None, 512, 512, 30) 0           concatenate_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 512, 512, 30) 120         dropout_16[0][0]                 
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 512, 512, 30) 0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 512, 512, 12) 29172       activation_25[0][0]              
__________________________________________________________________________________________________
dropout_17 (Dropout)            (None, 512, 512, 12) 0           conv2d_26[0][0]                  
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 512, 512, 12) 372         concatenate_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 512, 512, 12) 48          dropout_17[0][0]                 
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 512, 512, 12) 48          conv2d_28[0][0]                  
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 512, 512, 12) 0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 512, 512, 12) 0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 512, 512, 12) 11676       activation_26[0][0]              
__________________________________________________________________________________________________
add_8 (Add)                     (None, 512, 512, 12) 0           activation_27[0][0]              
                                                                 conv2d_27[0][0]                  
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 512, 512, 2)  26          add_8[0][0]                      
==================================================================================================
Total params: 5,738,222
Trainable params: 5,735,486
Non-trainable params: 2,736
__________________________________________________________________________________________________
